tutorials/fluidSolidInteraction/compressibleLiquid3dTube/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      flowProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rho             rho [1 -3 0 0 0 0 0] 1000;
//nu              nu [0 2 -1 0 0 0 0] 3e-6;
mu              mu [ 1 -1 -1 0 0 0 0 ] 3e-3;

// For piso/transientSimple
//transportModel  Newtonian;



// ************************************************************************* //
